{"data":{"markdownRemark":{"html":"<h2>Listen</h2>\n<p>Delicate Steve plays beautiful slide guitar melodies on top of each other. <em>Ramona Reborn</em> builds up with the interplay of three such voices:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/NJhxCgvac3k?rel=0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n<p>Another example of harmony which crossed my mind as we listened to drone sounds in class was classical sitar. Ravi Shankar demonstrates some of the best of this genre of music:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/gMk2eTqPLWk?rel=0&amp;start=1158\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n<h2>Code</h2>\n<p><a href=\"/projects/code-of-music/harmony-sketch\">Check out my p5.js sketch for the week here</a>.</p>\n<p>I started out by trying to emulate some of the slide guitar sounds in Delicate Steve's songs by using some basic pitch bending. I created a <code>PolySynth</code> and applied <code>rampTo</code> on each of the voices' frequencies right after triggering the attack stage of the envelope (notes are released when keys are released).</p>\n<p>I noticed that if I played notes quickly in succession, the pitch would start to increase past the bounds that I had initially programmed. <code>rampTo</code> was being called in quick succession to transpose the notes up the scale. Although this effect was an artifact of my initial naive implementation, I decided to run with the idea to compose some harmonies.</p>\n<p>I added a drone synth based off the <a href=\"https://editor.p5js.org/luisa/sketches/H1p3B-6cm\">drone_event</a> sample sketch. Mine uses an FM sine oscillator with triangle modulation. It plays a constant C2 note on every measure, except when there are multiple keys pressed -- then, it changes pitch to match the current (potentially ramped) frequency of the first voice in the <code>PolySynth</code>. This creates some interesting harmonies and disharmonies.</p>\n<p>There are a lot of parameters to tweak here... I'd like to see how the sketch sounds with the drone playing every 2 beats instead of every measure (so that it's easier to line up with notes the user is playing). I could also \"quantize\" the drone pitches so that it never gets caught on a dissonant frequency between notes (or even on notes that are not harmonic with the current scale) while <code>rampTo</code> is active.</p>\n<iframe src=\"https://player.vimeo.com/video/295222625\" width=\"640\" height=\"323\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>","frontmatter":{"date":"15 October 2018","title":"Week 5 harmony"},"fields":{"category":"code-of-music","slug":"/blog/itp/code-of-music/harmony/"}}},"pageContext":{"slug":"/blog/itp/code-of-music/harmony/"}}