{"data":{"markdownRemark":{"html":"<h3>Rubric of success</h3>\n<p>In my course project, I hope to explore abstract art with Weird Type—at a basic level, to demonstrate that it <em>is</em> possible with this container, and at a more nuanced level, to challenge viewers’ expectations of mobile videography by playing with space and time in unexpected ways. I'm using AR to accomplish computer graphics effects without writing code, creating 3D models, or using After Effects. I'll know I'm successful if I get reactions of the flavor \"how did you do that?\" and if I make viewers smile through use of metaphors[1].</p>\n<p>Notes</p>\n<ol>\n<li>I think one successful metaphor was the camera focus ring / puzzle visual metaphor in my <a href=\"blog/itp/content-and-its-discontents/good-content-mindmapping/\">first content iteration</a>.</li>\n</ol>\n<h3>Progress &#x26; ideas</h3>\n<p>I didn't make a fully formed composition this week, but I brainstormed some ideas, played around with Weird Type footage, and created a mood board for future iteration on this project.</p>\n<iframe src=\"https://player.vimeo.com/video/294203322\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n<p>One new metaphor I've stumbled upon here is <em>peeling back of layers of an image</em>, which is possible by moving the camera through the AR space and breaking the plane of these photo \"stamps\" I've placed in the world.</p>\n<p>Here's my <a href=\"https://www.are.na/adi-dahiya/weird-content-mood-board\">Are.na mood board</a>.</p>\n<p>One of the pieces of inspiration here which stood out to me was a music video made by <a href=\"https://www.kijekadamski.com/\">Kijek/Adamski</a>:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/Q-WM-x__BOk?rel=0&amp;start=121\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n<p>This combined with the stop motion technique of <a href=\"https://en.wikipedia.org/wiki/Pixilation\">pixilation</a> (h/t to Norman McLaren) gave me the idea of creating a Weird Type music video with a live dancer where the overall motion of the dance is revealed through stamped frames. This concept might tend more towards the realistic rather than the abstract (depending on the background of the shot), but that might be a necessary given the limitations of Weird Type's performance (it doesn't do well on undifferentiated, abstract backgrounds where it can't map the camera perspective to the real world; the type symbols end up floating all over the place).</p>","frontmatter":{"date":"8 October 2018","title":"Week 4 content iteration"},"fields":{"category":"content-and-its-discontents","slug":"/blog/itp/content-and-its-discontents/iteration-3/"}}},"pageContext":{"slug":"/blog/itp/content-and-its-discontents/iteration-3/"}}