{"data":{"markdownRemark":{"html":"<blockquote>\n<p>Pick a piece of interactive technology in public, used by multiple people. Write down your assumptions as to how it’s used, and describe the context in which it’s being used. Watch people use it, preferably without them knowing they’re being observed. Take notes on how they use it, what they do differently, what appear to be the difficulties, what appear to be the easiest parts. Record what takes the longest, what takes the least amount of time, and how long the whole transaction takes. Consider how the readings from Norman and Crawford reflect on what you see.</p>\n</blockquote>\n<p>I observed some bar patrons using pinball machines at Sunshine Laundromat in Greenpoint. This is interactive technology which people learn over time and can potentially master (that's how they get good at the game). Players have to watch the table for various signals:</p>\n<ul>\n<li>position of the paddles</li>\n<li>location of the pinball (there may be multiple balls in some games)</li>\n<li>position of various obstacles on the table which might move</li>\n<li>status of power-ups or bonus point triggers</li>\n<li>messages on the screen to indicate timing of certain events which give bonus points</li>\n</ul>\n<p>Beginning players often have trouble processing all of this information at once, so they are not able to make optimized choices about where to guide the pinball to get the most points. That's not usually their priority, though. Beginners are usually just trying to keep the game going for as long as possible so they can keep scoring points.</p>\n<p>Some players occasionally have difficulty triggering the initial deployment of the ball and have to try multiple times (they don't release the starting spring far / fast enough). Advanced players will sometimes use the technique of tilting the table slightly as a last-ditch effort to prevent the ball from being lost, but the difficulty there is that they can trip the tilt sensor which triggers a penalty (so they must be somewhat gentle). I think the easiest parts of the game are when the ball moves slowly into the player's control and they are able to stop it completely as it rests upon a paddle, so they can take their time and carefully line up their next strike to hit something specific on the table (alas, some players may even fail at this, but it is rare).</p>\n<p>The length of a \"transaction\" with a pinball machine can vary greatly since novice players might lose all their balls quickly while experts can keep going for many minutes. The machine is not designed for <em>efficient</em> interactions, but rather playful ones (it is a game after all).</p>","frontmatter":{"date":"26 September 2018","title":"Week 3 - Observation"},"fields":{"category":"physical-computing","slug":"/blog/itp/physical-computing/week-3-observation/"}}},"pageContext":{"slug":"/blog/itp/physical-computing/week-3-observation/"}}