{"data":{"markdownRemark":{"html":"<h2>Reading</h2>\n<h3><a href=\"https://www.corner-college.com/udb/cproVozeFxParagraphs_on_Conceptual_Art._Sol_leWitt.pdf\">\"Paragraphs on Conceptual Art\"</a> (Sol Lewitt)</h3>\n<blockquote>\n<p>When the viewer is dwarfed by the larger size of a piece this domination emphasizes the physical and emotive power of the form at the expense of losing the idea of the piece.</p>\n</blockquote>\n<p>Is the \"idea of the piece\" strictly separate from its \"physical and emotive power\"? Lewitt's phrasing suggests as much, but it's not self-evidently true to me.</p>\n<blockquote>\n<p>New materials are one of the great afflictions of contemporary art. Some artists confuse new materials with new ideas. There is nothing worse than seeing art that wallows in gaudy baubles. By and large most artists who are attracted to these materials are the ones who lack the stringency of mind that would enable them to use the materials well. It takes a good artist to use new materials and make them into a work of art. The danger is, I think, in making the physicality of the materials so important that it becomes the idea of the work (another kind of expressionism).</p>\n</blockquote>\n<p>Yep, very true. This is the challenge of working with new media.</p>\n<hr>\n<p>Overall, I liked this essay and it feels like a good primer on conceptual art. I have little experience making conceptual art myself, so I find it hard to provide much criticism of Lewitt's viewpoints on the subject. I'm also wary of what he says about certain people being well-suited to the mystical and irrational thinking required to produce conceptual art; as far as I can tell, that would require significant rewiring of my rational engineer brain. Still, I suppose the only way to get good at it is to try.</p>","frontmatter":{"date":"20 October 2018","title":"Week 6 conceptual art"},"fields":{"category":"content-and-its-discontents","slug":"/blog/itp/content-and-its-discontents/conceptual-art/"}}},"pageContext":{"slug":"/blog/itp/content-and-its-discontents/conceptual-art/"}}