{"data":{"markdownRemark":{"html":"<h3>Artist statement</h3>\n<p>AR can be used to create physical, visual experiences quickly, with common equipment. These sketches can be collected and juxtaposed.</p>\n<p>I want to share with you my experiences in AR in order to inspire creativity with the medium and gather feedback about how to build an engaging AR application. I am doing this to test the boundaries of the medium as a canvas for expression and play.</p>\n<p><a href=\"https://docs.google.com/presentation/d/13mEY2DA9NMSog5SPdaXomTIududu2GV56s3O4uQ4q2s\">Presentation slides viewable here</a>.</p>\n<h3>Prerequisites</h3>\n<p>iOS device, <a href=\"https://itunes.apple.com/us/app/weird-type/id1352785248?mt=8\">Weird Type application</a>, a willingness to experiment.</p>\n<p>But first, let the piece run its course, mechanically.</p>\n<h3>A series of interactive performance pieces</h3>\n<p>WT: <em>Weird Type</em> <br/>\nPOV: point of view</p>\n<h4>Piece for <em>Weird Type</em> (1)</h4>\n<p>Get a blank sheet of paper and and a pen. Hold the pen with your dominant hand. Hold the your phone with WT in your other hand, set to <em>photo</em> mode with the \".\" character as the active text. Start to draw or write your name on the paper while simultaneously retracting your phone from the paper and tapping the screen every second. Your actions should be slow and deliberate, the phone camera coming away from the paper in a motion perpendicular to its plane.</p>\n<p>Reflect on the accuracy of your drawing or writing by moving through the frames you have created in AR.</p>\n<details>\n    <summary>See an example</summary>\n    <iframe src=\"https://player.vimeo.com/video/296465326?loop=1&title=0&byline=0&portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n</details>\n<h4>Piece for <em>Weird Type</em> (2)</h4>\n<p>Find a place in nature or your built environment where two patterns are visually juxtaposed. Take out your phone with WT set to <em>photo</em> mode with the \"o\" character set as the active text. Point the camera at the juxtaposition you have observed and tap the screen.</p>\n<p>Move the camera perspective slightly in all directions and rotational axes, observing your floating shape in the context of its surroundings.</p>\n<details>\n    <summary>See an example</summary>\n    <iframe src=\"https://player.vimeo.com/video/291593464?loop=1&title=0&byline=0&portrait=0\" width=\"640\" height=\"295\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n</details>\n<h4>Piece for <em>Weird Type</em> (3)</h4>\n<p>Stand in a safe, peaceful place (perhaps your home). Use your phone with WT set to <em>photo</em> mode and the \".\" character as the active text to create a 3×3' wall of photos in space. The planes do not have to be perfectly parallel, but avoid creating gaps between photos as much as possible. Switch perspectives and build an adjoining wall at 90 degrees. Continue until you have built a cube.</p>\n<p>Sit inside the cube and contemplate what home means to you.</p>\n<details>\n    <summary>See an example</summary>\n    Coming soon\n</details>\n<h4>Piece for <em>Weird Type</em> (4)</h4>\n<p>Walk around the block while listening to a piece of music that makes you feel good. Use WT set to <em>photo</em> mode and the \".\" character set as the active text. Hold your phone near eye-level to approximate a human POV. Tap the screen to the beat as you walk.</p>\n<p>After the track finishes, retrace your steps and observe the snapshots you have created.</p>\n<details>\n    <summary>See an example</summary>\n    Coming soon\n</details>\n<h4>Piece for <em>Weird Type</em> (5)</h4>\n<p>Pick a word you had to look up the definition of recently. Use WT set to <em>break</em> mode and set your word as the active text. Start to move your phone around a 3×3' cubed area in space, covering most of the invisible volume. Keep your phone pointed in the same direction as you do this, and tap the screen quickly. Stop when most of the camera POV is obscured by letters of your word.</p>\n<p>Travel through your field of letter fragments.</p>\n<details>\n    <summary>See an example</summary>\n    <iframe src=\"https://player.vimeo.com/video/296453019?loop=1&title=0&byline=0&portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n</details>\n<h4>Piece for <em>Weird Type</em> (6)</h4>\n<p>Two people face each other and have a conversation. They each have their phone in front of them so that they look at each other through the camera POV on the screen in front of them. Use WT in <em>photo</em> mode with \".\" as the active text. Take turns speaking, each time you are done speaking stop looking at your screen and look at the other person directly. The person who is next to speak should tap the screen to capture a snapshot of the face they will speak to while it is their turn.</p>\n<p>The piece ends when the conversation is finished.</p>\n<details>\n    <summary>See an example</summary>\n    <iframe src=\"https://player.vimeo.com/video/296468922?loop=1&title=0&byline=0&portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n</details>\n<h4>Piece for <em>Weird Type</em> (7)</h4>\n<p>Use WT in <em>photo</em> mode with \".\" as the active text. Observe something in motion coming towards you in your environment. Take repeated quick snapshots of its action by tapping the screen and slightly changing your phone POV.</p>\n<p>Do the same for an object going away from you.</p>\n<details>\n    <summary>See an example</summary>\n    <iframe src=\"https://player.vimeo.com/video/296469469?loop=1&title=0&byline=0&portrait=0\" width=\"640\" height=\"480\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n</details>\n<h4>Piece for <em>Weird Type</em> (8)</h4>\n<p>Use WT in <em>photo</em> mode with \".\" as the active text. Do not reset the app during this piece [1]. Take a photo of the sky from a place you can access easily throughout the day, like your desk window. Take snapshots at different times of the day and leave them where you took them.</p>\n<p>Come back later and observe how the light changed.</p>\n<details>\n    <summary>See an example</summary>\n    Coming soon\n</details>\n<h4>Piece for <em>Weird Type</em> (9)</h4>\n<p>Use WT in <em>stamp</em> mode with \"o\" as the active text. Tap and hold the screen while moving your phone in space to create a black &#x26; white tunnel. The tunnel can be as long or short as you want. The piece is over when you release the stamping action in WT.</p>\n<p>Travel through your tunnel. Where does it take you?</p>\n<details>\n    <summary>See an example</summary>\n    <iframe src=\"https://player.vimeo.com/video/296476583?loop=1&title=0&byline=0&portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n</details>\n<h4>Piece for <em>Weird Type</em> (10)</h4>\n<p>Use WT in <em>photo</em> mode and any active text you wish. Point your camera towards the sky and attempt to make word snapshots. The piece is over if and when the words stabilize in your camera's POV, or go completely out of view.</p>\n<p>What did you just see?</p>\n<details>\n    <summary>See an example</summary>\n    <iframe src=\"https://player.vimeo.com/video/296470448?loop=1&title=0&byline=0&portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n</details>\n<h3>Implementation notes</h3>\n<p>Some pieces are difficult to perform and feel unintuitive within this container. A future version of work will use a custom-designed AR application.</p>\n<ol>\n<li>Weird Type resets any time you close and re-open the app, so in practice this means you must leave the app open during the duration of this piece.</li>\n</ol>","frontmatter":{"date":"22 October 2018","title":"Week 7 AR study (final project)"},"fields":{"category":"content-and-its-discontents","slug":"/blog/itp/content-and-its-discontents/ar-study/"}}},"pageContext":{"slug":"/blog/itp/content-and-its-discontents/ar-study/"}}